iatadjango/templates/ndc/AirDocDisplay.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:edis="http://www.iata.org/IATA/EDIST">
   <soapenv:Header />
   <soapenv:Body>
      <edis:AirDocDisplayRQ>
         <edis:Document>
            <edis:Name>NDC</edis:Name>
            <edis:ReferenceVersion>15.2</edis:ReferenceVersion>
         </edis:Document>
         <edis:Party>
            <edis:Sender>
               <edis:AgentUserSender>
                  <edis:AgentUserID>HKTHONUSR</edis:AgentUserID>
               </edis:AgentUserSender>
            </edis:Sender>
            <edis:Recipient>
               <edis:ORA_Recipient>
                  <edis:AirlineID>XQ</edis:AirlineID>
               </edis:ORA_Recipient>
            </edis:Recipient>
         </edis:Party>
         <edis:Query>
            <edis:TicketDocument>
               <edis:TicketDocNbr>{{pnr}}</edis:TicketDocNbr>
            </edis:TicketDocument>
         </edis:Query>
      </edis:AirDocDisplayRQ>
   </soapenv:Body>
</soapenv:Envelope>

